Repository: salines/cakephp-verification
Catalog: resources/locales/*/verification.po
Languages: ar, de, es, fr, hr, it, ja, ko, pl, ru, uk, zh_cn

source: Additional verification is required to proceed.
ar: يلزم تحقق إضافي للمتابعة.
de: Zusätzliche Verifizierung ist erforderlich, um fortzufahren.
es: Se requiere verificación adicional para continuar.
fr: Une vérification supplémentaire est requise pour continuer.
hr: Potrebna je dodatna verifikacija za nastavak.
it: È richiesta una verifica aggiuntiva per continuare.
ja: 続行するには追加の認証が必要です。
ko: 계속하려면 추가 인증이 필요합니다.
pl: Do kontynuacji wymagana jest dodatkowa weryfikacja.
ru: Для продолжения требуется дополнительная проверка.
uk: Для продовження потрібна додаткова перевірка.
zh_cn: 继续操作需要额外验证。

source: Invalid transport definition: {0}
ar: تعريف النقل غير صالح: {0}
de: Ungültige Transportdefinition: {0}
es: Definición de transporte inválida: {0}
fr: Définition de transport invalide : {0}
hr: Neispravna definicija transporta: {0}
it: Definizione di trasporto non valida: {0}
ja: 無効なトランスポート定義: {0}
ko: 잘못된 전송 정의: {0}
pl: Nieprawidłowa definicja transportu: {0}
ru: Неверное определение транспорта: {0}
uk: Невірне визначення транспорту: {0}
zh_cn: 无效的传输定义：{0}

source: Unknown transport: {0}
ar: نقل غير معروف: {0}
de: Unbekannter Transport: {0}
es: Transporte desconocido: {0}
fr: Transport inconnu : {0}
hr: Nepoznat transport: {0}
it: Trasporto sconosciuto: {0}
ja: 不明なトランスポート: {0}
ko: 알 수 없는 전송: {0}
pl: Nieznany transport: {0}
ru: Неизвестный транспорт: {0}
uk: Невідомий транспорт: {0}
zh_cn: 未知的传输方式：{0}

source: OTP resend cooldown is active.
ar: فترة الانتظار لإعادة إرسال OTP فعالة.
de: Die OTP-Neusende-Sperre ist aktiv.
es: El tiempo de espera para reenviar OTP está activo.
fr: Le délai de renvoi OTP est actif.
hr: OTP cooldown za ponovno slanje je aktivan.
it: Il cooldown per il reinvio OTP è attivo.
ja: OTP再送のクールダウン中です。
ko: OTP 재전송 쿨다운이 활성화되었습니다.
pl: Okres oczekiwania na ponowne wysłanie OTP jest aktywny.
ru: Активна задержка повторной отправки OTP.
uk: Активна затримка повторного надсилання OTP.
zh_cn: OTP 重发冷却中。

source: Identity key is missing for OTP storage.
ar: مفتاح الهوية مفقود لتخزين OTP.
de: Identitätsschlüssel für OTP-Speicherung fehlt.
es: Falta la clave de identidad para el almacenamiento de OTP.
fr: La clé d’identité est manquante pour le stockage OTP.
hr: Nedostaje identitetski kljuc za OTP pohranu.
it: Manca la chiave di identità per la memorizzazione OTP.
ja: OTP保存のための識別キーがありません。
ko: OTP 저장을 위한 식별 키가 없습니다.
pl: Brak klucza tożsamości do przechowywania OTP.
ru: Отсутствует ключ идентичности для хранения OTP.
uk: Відсутній ключ ідентичності для зберігання OTP.
zh_cn: 缺少用于 OTP 存储的身份键。

source: Email One-Time Code
ar: رمز بريد إلكتروني لمرة واحدة
de: E-Mail-Einmalcode
es: Código de un solo uso por correo
fr: Code à usage unique par e‑mail
hr: Email jednokratni kod
it: Codice monouso email
ja: メールのワンタイムコード
ko: 이메일 일회용 코드
pl: Jednorazowy kod e-mail
ru: Одноразовый код по email
uk: Одноразовий код електронної пошти
zh_cn: 邮件一次性验证码

source: SMS One-Time Code
ar: رمز SMS لمرة واحدة
de: SMS-Einmalcode
es: Código de un solo uso por SMS
fr: Code à usage unique par SMS
hr: SMS jednokratni kod
it: Codice monouso SMS
ja: SMSワンタイムコード
ko: SMS 일회용 코드
pl: Jednorazowy kod SMS
ru: Одноразовый код по SMS
uk: Одноразовий SMS‑код
zh_cn: 短信一次性验证码

source: Authenticator App (TOTP)
ar: تطبيق المصادقة (TOTP)
es: Aplicación autenticadora (TOTP)
fr: Application d’authentification (TOTP)
hr: Authenticator aplikacija (TOTP)
it: App di autenticazione (TOTP)
ja: 認証アプリ（TOTP）
ko: 인증 앱 (TOTP)
pl: Aplikacja uwierzytelniająca (TOTP)
ru: Приложение-аутентификатор (TOTP)
uk: Автентифікатор (TOTP)
zh_cn: 认证应用（TOTP）

source: AesGcmCrypto requires a non-empty key.
ar: يتطلب AesGcmCrypto مفتاحًا غير فارغ.
de: AesGcmCrypto erfordert einen nicht leeren Schlüssel.
es: AesGcmCrypto requiere una clave no vacía.
fr: AesGcmCrypto requiert une clé non vide.
hr: AesGcmCrypto zahtijeva ne-prazan kljuc.
it: AesGcmCrypto richiede una chiave non vuota.
ja: AesGcmCryptoには空でないキーが必要です。
ko: AesGcmCrypto에는 비어 있지 않은 키가 필요합니다.
pl: AesGcmCrypto wymaga niepustego klucza.
ru: AesGcmCrypto требует непустой ключ.
uk: AesGcmCrypto потребує непорожній ключ.
zh_cn: AesGcmCrypto 需要非空密钥。

source: Invalid key length for AesGcmCrypto. Expected {0} bytes, got {1}.
ar: طول مفتاح غير صالح لـ AesGcmCrypto. المتوقع {0} بايت، تم الحصول على {1}.
de: Ungültige Schlüssellänge für AesGcmCrypto. Erwartet {0} Bytes, erhalten {1}.
es: Longitud de clave inválida para AesGcmCrypto. Se esperaban {0} bytes, se obtuvieron {1}.
fr: Longueur de clé invalide pour AesGcmCrypto. Attendu {0} octets, reçu {1}.
hr: Neispravna duljina kljuca za AesGcmCrypto. Ocekivano {0} bajtova, dobiveno {1}.
it: Lunghezza chiave non valida per AesGcmCrypto. Attesi {0} byte, ottenuti {1}.
ja: AesGcmCryptoのキー長が不正です。期待値 {0} バイト、実際 {1}。
ko: AesGcmCrypto 키 길이가 잘못되었습니다. {0}바이트를 기대했지만 {1}바이트입니다.
pl: Nieprawidłowa długość klucza dla AesGcmCrypto. Oczekiwano {0} bajtów, otrzymano {1}.
ru: Неверная длина ключа для AesGcmCrypto. Ожидалось {0} байт, получено {1}.
uk: Невірна довжина ключа для AesGcmCrypto. Очікується {0} байтів, отримано {1}.
zh_cn: AesGcmCrypto 密钥长度无效。期望 {0} 字节，得到 {1}。

source: Invalid IV length for AES-GCM.
ar: طول IV غير صالح لـ AES-GCM.
de: Ungültige IV-Länge für AES-GCM.
es: Longitud de IV inválida para AES-GCM.
fr: Longueur d’IV invalide pour AES‑GCM.
hr: Neispravna duljina IV za AES-GCM.
it: Lunghezza IV non valida per AES-GCM.
ja: AES-GCMのIV長が不正です。
ko: AES-GCM IV 길이가 올바르지 않습니다.
pl: Nieprawidłowa długość IV dla AES-GCM.
ru: Неверная длина IV для AES-GCM.
uk: Невірна довжина IV для AES-GCM.
zh_cn: AES-GCM 的 IV 长度无效。

source: Encryption failed using AesGcmCrypto.
ar: فشل التشفير باستخدام AesGcmCrypto.
de: Verschlüsselung mit AesGcmCrypto fehlgeschlagen.
es: Falló el cifrado usando AesGcmCrypto.
fr: Échec du chiffrement avec AesGcmCrypto.
hr: Enkripcija nije uspjela koristeci AesGcmCrypto.
it: Cifratura fallita con AesGcmCrypto.
ja: AesGcmCryptoによる暗号化に失敗しました。
ko: AesGcmCrypto로 암호화에 실패했습니다.
pl: Szyfrowanie przy użyciu AesGcmCrypto nie powiodło się.
ru: Шифрование с AesGcmCrypto не удалось.
uk: Шифрування з AesGcmCrypto не вдалося.
zh_cn: 使用 AesGcmCrypto 加密失败。

source: Invalid base64 payload for AesGcmCrypto.
ar: حمولة base64 غير صالحة لـ AesGcmCrypto.
de: Ungültige Base64-Nutzlast für AesGcmCrypto.
es: Carga base64 inválida para AesGcmCrypto.
fr: Charge utile base64 invalide pour AesGcmCrypto.
hr: Neispravan base64 payload za AesGcmCrypto.
it: Payload base64 non valido per AesGcmCrypto.
ja: AesGcmCryptoのbase64ペイロードが不正です。
ko: AesGcmCrypto의 base64 페이로드가 올바르지 않습니다.
pl: Nieprawidłowy ładunek base64 dla AesGcmCrypto.
ru: Неверная base64‑нагрузка для AesGcmCrypto.
uk: Невірне base64‑навантаження для AesGcmCrypto.
zh_cn: AesGcmCrypto 的 base64 载荷无效。

source: Invalid payload size for AesGcmCrypto.
ar: حجم الحمولة غير صالح لـ AesGcmCrypto.
de: Ungültige Nutzlastgröße für AesGcmCrypto.
es: Tamaño de carga inválido para AesGcmCrypto.
fr: Taille de charge utile invalide pour AesGcmCrypto.
hr: Neispravna velicina payload-a za AesGcmCrypto.
it: Dimensione del payload non valida per AesGcmCrypto.
ja: AesGcmCryptoのペイロードサイズが不正です。
ko: AesGcmCrypto의 페이로드 크기가 올바르지 않습니다.
pl: Nieprawidłowy rozmiar ładunku dla AesGcmCrypto.
ru: Неверный размер нагрузки для AesGcmCrypto.
uk: Невірний розмір навантаження для AesGcmCrypto.
zh_cn: AesGcmCrypto 的载荷大小无效。

source: Decryption failed using AesGcmCrypto.
ar: فشل فك التشفير باستخدام AesGcmCrypto.
de: Entschlüsselung mit AesGcmCrypto fehlgeschlagen.
es: Falló el descifrado usando AesGcmCrypto.
fr: Échec du déchiffrement avec AesGcmCrypto.
hr: Dekripcija nije uspjela koristeci AesGcmCrypto.
it: Decifratura fallita con AesGcmCrypto.
ja: AesGcmCryptoによる復号に失敗しました。
ko: AesGcmCrypto로 복호화에 실패했습니다.
pl: Odszyfrowanie przy użyciu AesGcmCrypto nie powiodło się.
ru: Расшифрование с AesGcmCrypto не удалось.
uk: Дешифрування з AesGcmCrypto не вдалося.
zh_cn: 使用 AesGcmCrypto 解密失败。

source: OpenSSL cipher "{0}" is not supported.
ar: شفرة OpenSSL "{0}" غير مدعومة.
de: OpenSSL-Cipher "{0}" wird nicht unterstützt.
es: El cifrado OpenSSL "{0}" no es compatible.
fr: Le chiffrement OpenSSL "{0}" n’est pas pris en charge.
hr: OpenSSL cipher "{0}" nije podrzan.
it: Il cifrario OpenSSL "{0}" non è supportato.
ja: OpenSSL暗号 "{0}" はサポートされていません。
ko: OpenSSL 암호 "{0}"는 지원되지 않습니다.
pl: Szyfr OpenSSL "{0}" nie jest obsługiwany.
ru: Шифр OpenSSL "{0}" не поддерживается.
uk: Шифр OpenSSL "{0}" не підтримується.
zh_cn: 不支持 OpenSSL 密码 "{0}"。

source: SodiumCrypto requires a non-empty key.
ar: يتطلب SodiumCrypto مفتاحًا غير فارغ.
de: SodiumCrypto erfordert einen nicht leeren Schlüssel.
es: SodiumCrypto requiere una clave no vacía.
fr: SodiumCrypto requiert une clé non vide.
hr: SodiumCrypto zahtijeva ne-prazan kljuc.
it: SodiumCrypto richiede una chiave non vuota.
ja: SodiumCryptoには空でないキーが必要です。
ko: SodiumCrypto에는 비어 있지 않은 키가 필요합니다.
pl: SodiumCrypto wymaga niepustego klucza.
ru: SodiumCrypto требует непустой ключ.
uk: SodiumCrypto потребує непорожній ключ.
zh_cn: SodiumCrypto 需要非空密钥。

source: Invalid key length for SodiumCrypto. Expected {0} bytes, got {1}.
ar: طول مفتاح غير صالح لـ SodiumCrypto. المتوقع {0} بايت، تم الحصول على {1}.
de: Ungültige Schlüssellänge für SodiumCrypto. Erwartet {0} Bytes, erhalten {1}.
es: Longitud de clave inválida para SodiumCrypto. Se esperaban {0} bytes, se obtuvieron {1}.
fr: Longueur de clé invalide pour SodiumCrypto. Attendu {0} octets, reçu {1}.
hr: Neispravna duljina kljuca za SodiumCrypto. Ocekivano {0} bajtova, dobiveno {1}.
it: Lunghezza chiave non valida per SodiumCrypto. Attesi {0} byte, ottenuti {1}.
ja: SodiumCryptoのキー長が不正です。期待値 {0} バイト、実際 {1}。
ko: SodiumCrypto 키 길이가 잘못되었습니다. {0}바이트를 기대했지만 {1}바이트입니다.
pl: Nieprawidłowa długość klucza dla SodiumCrypto. Oczekiwano {0} bajtów, otrzymano {1}.
ru: Неверная длина ключа для SodiumCrypto. Ожидалось {0} байт, получено {1}.
uk: Невірна довжина ключа для SodiumCrypto. Очікується {0} байтів, отримано {1}.
zh_cn: SodiumCrypto 密钥长度无效。期望 {0} 字节，得到 {1}。

source: Encryption failed using SodiumCrypto.
ar: فشل التشفير باستخدام SodiumCrypto.
de: Verschlüsselung mit SodiumCrypto fehlgeschlagen.
es: Falló el cifrado usando SodiumCrypto.
fr: Échec du chiffrement avec SodiumCrypto.
hr: Enkripcija nije uspjela koristeci SodiumCrypto.
it: Cifratura fallita con SodiumCrypto.
ja: SodiumCryptoによる暗号化に失敗しました。
ko: SodiumCrypto로 암호화에 실패했습니다.
pl: Szyfrowanie przy użyciu SodiumCrypto nie powiodło się.
ru: Шифрование с SodiumCrypto не удалось.
uk: Шифрування з SodiumCrypto не вдалося.
zh_cn: 使用 SodiumCrypto 加密失败。

source: Invalid base64 payload for SodiumCrypto.
ar: حمولة base64 غير صالحة لـ SodiumCrypto.
de: Ungültige Base64-Nutzlast für SodiumCrypto.
es: Carga base64 inválida para SodiumCrypto.
fr: Charge utile base64 invalide pour SodiumCrypto.
hr: Neispravan base64 payload za SodiumCrypto.
it: Payload base64 non valido per SodiumCrypto.
ja: SodiumCryptoのbase64ペイロードが不正です。
ko: SodiumCrypto의 base64 페이로드가 올바르지 않습니다.
pl: Nieprawidłowy ładunek base64 dla SodiumCrypto.
ru: Неверная base64‑нагрузка для SodiumCrypto.
uk: Невірне base64‑навантаження для SodiumCrypto.
zh_cn: SodiumCrypto 的 base64 载荷无效。

source: Invalid payload size for SodiumCrypto.
ar: حجم الحمولة غير صالح لـ SodiumCrypto.
de: Ungültige Nutzlastgröße für SodiumCrypto.
es: Tamaño de carga inválido para SodiumCrypto.
fr: Taille de charge utile invalide pour SodiumCrypto.
hr: Neispravna velicina payload-a za SodiumCrypto.
it: Dimensione del payload non valida per SodiumCrypto.
ja: SodiumCryptoのペイロードサイズが不正です。
ko: SodiumCrypto의 페이로드 크기가 올바르지 않습니다.
pl: Nieprawidłowy rozmiar ładunku dla SodiumCrypto.
ru: Неверный размер нагрузки для SodiumCrypto.
uk: Невірний розмір навантаження для SodiumCrypto.
zh_cn: SodiumCrypto 的载荷大小无效。

source: Decryption failed using SodiumCrypto.
ar: فشل فك التشفير باستخدام SodiumCrypto.
de: Entschlüsselung mit SodiumCrypto fehlgeschlagen.
es: Falló el descifrado usando SodiumCrypto.
fr: Échec du déchiffrement avec SodiumCrypto.
hr: Dekripcija nije uspjela koristeci SodiumCrypto.
it: Decifratura fallita con SodiumCrypto.
ja: SodiumCryptoによる復号に失敗しました。
ko: SodiumCrypto로 복호화에 실패했습니다.
pl: Odszyfrowanie przy użyciu SodiumCrypto nie powiodło się.
ru: Расшифрование с SodiumCrypto не удалось.
uk: Дешифрування з SodiumCrypto не вдалося.
zh_cn: 使用 SodiumCrypto 解密失败。

source: Invalid base64 payload for Base64Crypto.
ar: حمولة base64 غير صالحة لـ Base64Crypto.
de: Ungültige Base64-Nutzlast für Base64Crypto.
es: Carga base64 inválida para Base64Crypto.
fr: Charge utile base64 invalide pour Base64Crypto.
hr: Neispravan base64 payload za Base64Crypto.
it: Payload base64 non valido per Base64Crypto.
ja: Base64Cryptoのbase64ペイロードが不正です。
ko: Base64Crypto의 base64 페이로드가 올바르지 않습니다.
pl: Nieprawidłowy ładunek base64 dla Base64Crypto.
ru: Неверная base64‑нагрузка для Base64Crypto.
uk: Невірне base64‑навантаження для Base64Crypto.
zh_cn: Base64Crypto 的 base64 载荷无效。
